YaroslavTrymbach/ChargeStation/Stm32/ChargeStationCentralCPU/Src/main.c
}

/* USART3 init function */
static void MX_USART3_UART_Init(void)
{

  huart3.Instance = USART3;
  huart3.Init.BaudRate = 115200;
  huart3.Init.WordLength = UART_WORDLENGTH_8B;
  huart3.Init.StopBits = UART_STOPBITS_1;
  huart3.Init.Parity = UART_PARITY_NONE;
  huart3.Init.Mode = UART_MODE_TX_RX;
  huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart3.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart3) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/** 
  * Enable DMA controller clock
  */
static void MX_DMA_Init(void) 
{
  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Stream2_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream2_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream2_IRQn);
  /* DMA1_Stream6_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);
  /* DMA1_Stream7_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream7_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream7_IRQn);

}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(RFID_CS_GPIO_Port, RFID_CS_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, LD3_Pin|LD2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(USB_PowerSwitchOn_GPIO_Port, USB_PowerSwitchOn_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : RFID_CS_Pin */
  GPIO_InitStruct.Pin = RFID_CS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(RFID_CS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : USER_Btn_Pin */
  GPIO_InitStruct.Pin = USER_Btn_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(USER_Btn_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : LD3_Pin LD2_Pin */
  GPIO_InitStruct.Pin = LD3_Pin|LD2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : USB_PowerSwitchOn_Pin */
  GPIO_InitStruct.Pin = USB_PowerSwitchOn_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(USB_PowerSwitchOn_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : USB_OverCurrent_Pin */
  GPIO_InitStruct.Pin = USB_OverCurrent_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(USB_OverCurrent_GPIO_Port, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

}

/* USER CODE BEGIN 4 */

void toggleBlueLed(void){
	HAL_GPIO_TogglePin(LD2_GPIO_Port, LD2_Pin);
}

void processMessageFromNET(GeneralMessage *message){
	NetInputMessage netMessage;
	printf("Main task. Message from NET is got\n");
	char s[32];
	switch(message->messageId){
		case MESSAGE_NET_SERVER_ACCEPT:
			sprintf(s, "Station %s", message->param1 ? "ACCEPTED" : "REJECTED");
		  Display_PrintStrLeft(1, s);
		
		  if(NET_is_station_accepted()){
				//When station is accepted. It is need to send charge point status to server
				netMessage.messageId = NET_INPUT_MESSAGE_SEND_CHARGE_POINT_STATUS;
				NET_sendInputMessage(&netMessage);
			}
			break;
		case MESSAGE_NET_AUTHORIZE:
			printf("Authorize %s\n", message->param1 ? "SUCCESS" : "FAILED");
			sprintf(s, "Authorize %s", message->param1 ? "SUCCESS" : "FAILED");
		  Display_PrintStrLeft(1, s);			
			break;
	}
}
	
#define PACK_TO_PARAM_BYTE0(param, value) param |= (value & 0xFF)
#define PACK_TO_PARAM_BYTE1(param, value) param |= ((value & 0xFF) << 8)
#define PACK_TO_PARAM_BYTE2(param, value) param |= ((value & 0xFF) << 16)
#define PACK_TO_PARAM_BYTE3(param, value) param |= ((value & 0xFF) << 24)

void processMessageFromChannels(GeneralMessage *message){
	int connIndex;
	NetInputMessage netMessage;
	
	switch(message->messageId){
		case MESSAGE_CHANNEL_STATUS_CHANGED:
			connIndex = message->param1;
		  //If connection with server is present it is need to send new status 
		  if(NET_is_station_accepted()){
				netMessage.messageId = NET_INPUT_MESSAGE_SEND_CONNECTOR_STATUS;
				netMessage.param1 = 0;
				PACK_TO_PARAM_BYTE0(netMessage.param1, connIndex + 1);
				PACK_TO_PARAM_BYTE1(netMessage.param1, connector[connIndex].status);
				PACK_TO_PARAM_BYTE2(netMessage.param1, CHARGE_POINT_ERROR_CODE_NO_ERROR);
				NET_sendInputMessage(&netMessage);
			}
			break;
	}
}

void processMessageFromRFID(GeneralMessage *message){
	uint32_t cardId;
	char s[32];
	NetInputMessage netMessage;
	
	printf("Main task. Message from RFID is got\n");
	switch(message->messageId){
		case MESSAGE_RFID_FOUND_CARD:
			cardId = message->param1;
			printf("CardId 0x%.8X\n", cardId);
		
		  if(cardId != lastCheckedTagId){
				Display_PrintStrCenter(0, "Card discovered");
				sprintf(s, "CardId 0x%.8X", cardId);
				Display_PrintStrLeft(1, s);
		
				netMessage.messageId = NET_INPUT_MESSAGE_AUTHORIZE;
				netMessage.param1 = cardId;
				NET_sendInputMessage(&netMessage);
				
				lastCheckedTagId = cardId;
			}
			break;
		case MESSAGE_RFID_CONNECTION:
			if(message->param1){
				//Connected
				ChargePoint_setRFIDEnabled(true);
			}
			else{
				//Disconnected
				ChargePoint_setRFIDEnabled(false);
			}
			netMessage.messageId = NET_INPUT_MESSAGE_SEND_CHARGE_POINT_STATUS;
			NET_sendInputMessage(&netMessage);
			break;
	}
}

void processMessageFromSerialControl(GeneralMessage *message){
	printf("Main task. Message from SerialControl is got\n");
	ChargePointSetting* st;	
	switch(message->messageId){
		case MESSAGE_SER_CONTROL_SET_LOCAL_IP:
			NET_changeLocalIp();
			break;
		case MESSAGE_SER_CONTROL_SET_SERVER_HOST:
			st = Settings_get();
			NET_CONN_setRemoteHost(st->serverHost);
			break;
		case MESSAGE_SER_CONTROL_SET_SERVER_PORT:
			st = Settings_get();
			NET_CONN_setRemotePort(st->serverPort);
			break;
	}
}

void testSaveSetting(){
	printf("testSaveSetting\n");
	sprintf(settings->ChargePointId, "SaveCP_%.8X", generateRnd32());
	printf("New ChargePointID: %s\n", settings->ChargePointId);
	if(Settings_save())
		printf("Setting saving is success\n");
	else
		printf("Setting saving is failed\n");
}

void testReconnect(){
	NetInputMessage mes;
	mes.messageId = NET_INPUT_MESSAGE_RECONNECT;
	NET_sendInputMessage(&mes);
}

void printCurrentDateTime(){
	struct tm dt;
	
	if(isNeedSetTime){
		dt.tm_mday = 11;
		dt.tm_mon = 7;
		dt.tm_year = 2018;
	
		dt.tm_hour = 15;
		dt.tm_min = 41;
		dt.tm_sec = 39;
	
		setCurrentTime(&dt);
		
		isNeedSetTime = false;
	}
	else{
		getCurrentTime(&dt);
		printf("DateTime: %.2d.%.2d.%.4d %.2d:%.2d:%.2d\n", dt.tm_mday, dt.tm_mon, dt.tm_year, dt.tm_hour, dt.tm_min, dt.tm_sec);
	}
}

